Привет, охотник на монстров. 
->main
=== main ===

    +[Что слышно в последнее время?]
        (новости или инфа о мире)
        ->main
    *[У тебя есть для меня задание?]
        ->quest
        
    +[У тебя есть что нибудь на продажу?]
        Конечно!
        (Происходит обмен)
        ->main
    +[Мне пора.]
        До скорого.
->END

===quest===
(Описание квеста)
*[Я возьмусь за это.]
            Отлично.
            (Начинается квест)
            ->main
*[Мне нужно подумать.]
            Твое право
->main